# empty file

is_stripe = Dir.exist?("/Applications/Santa.app")

# ╭──────────────────────────────────────────────────────────╮
# │ Terminal                                                 │
# ╰──────────────────────────────────────────────────────────╯
if OS.mac? && !is_stripe
  cask "alacritty"
end

# ╭──────────────────────────────────────────────────────────╮
# │ Core                                                     │
# ╰──────────────────────────────────────────────────────────╯
brew "fd"
brew "readline"
brew "ripgrep"
brew "wget"
brew "xz"

# ╭──────────────────────────────────────────────────────────╮
# │ Fonts                                                    │
# ╰──────────────────────────────────────────────────────────╯
if OS.mac?
  # cask "font-jetbrains-mono-nerd-font"
  cask "font-inconsolata-go-nerd-font"
end

# ╭──────────────────────────────────────────────────────────╮
# │ Git                                                      │
# ╰──────────────────────────────────────────────────────────╯
brew "diff-so-fancy"
brew "gh" if OS.mac?
brew "git"
brew "go-jira" if OS.mac?
brew "lazygit"

# ╭──────────────────────────────────────────────────────────╮
# │ Node                                                     │
# ╰──────────────────────────────────────────────────────────╯
brew "nodenv"
brew "node-build"

# ╭──────────────────────────────────────────────────────────╮
# │ Python                                                   │
# ╰──────────────────────────────────────────────────────────╯
brew "pyenv"
brew "pyenv-virtualenv"

# ╭──────────────────────────────────────────────────────────╮
# │ Ruby                                                     │
# ╰──────────────────────────────────────────────────────────╯
brew "openssl"
brew "rbenv"
brew "ruby-build"

# ╭──────────────────────────────────────────────────────────╮
# │ Backups                                                  │
# ╰──────────────────────────────────────────────────────────╯
if OS.mac? && !is_stripe
  brew "restic"
end

# ╭──────────────────────────────────────────────────────────╮
# │ Neovim                                                   │
# ╰──────────────────────────────────────────────────────────╯
brew "bat"
brew "neovim"
brew "tree-sitter"

# vim: set ft=ruby
